---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepUpperTopElevation
source: html/0141ae8c-cc93-d6bd-56ac-1d560e0c20c4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepUpperTopElevation Property

"Upper End Top Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId MepUpperTopElevation { get; }
```